Repository: thomas-domville/AppleVis
Catalog: AppleVis/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, el, es, fa, fr, he, hi, id, it, ja, ko, nl, pl, pt, ru, sv, th, tr, uk, vi, zh_hans

source: App Entry comments had a Mark as Helpful action, in both the VoiceOver Actions rotor and the long-press menu, that only ever showed a "coming soon" toast — no real functionality behind it yet. Forums already held this back for the same reason, and it was never added to Guides, Blogs, Podcasts, or Bug Reports either. Removed from App Entries too until that backend work actually lands. Reported directly.
ar: كانت تعليقات صفحة التطبيق تحتوي على إجراء وضع علامة مفيد، سواء في دوار إجراءات VoiceOver أو في قائمة الضغط المطوّل، لا يفعل شيئًا سوى إظهار رسالة "قريبًا" — دون أي وظيفة حقيقية وراءه بعد. المنتديات كانت قد أوقفت هذا الإجراء بالفعل لنفس السبب، ولم يُضَف أصلًا إلى الأدلة أو المدونات أو البودكاست أو تقارير الأخطاء. أُزيل من صفحات التطبيقات أيضًا حتى يكتمل ذلك العمل في الخلفية فعليًا. أُبلغ عنه مباشرة.
de: App-Entry-Kommentare hatten eine Als-hilfreich-markieren-Aktion, sowohl im VoiceOver-Aktionen-Rotor als auch im Long-Press-Menü, die nur die Meldung „Demnächst verfügbar" zeigte — noch ohne echte Funktion dahinter. Bei Foren war das aus demselben Grund bereits entfernt worden, und bei Anleitungen, Blogbeiträgen, Podcasts oder Fehlerberichten wurde sie nie hinzugefügt. Jetzt auch bei App-Einträgen entfernt, bis diese Backend-Arbeit wirklich fertig ist. Direkt gemeldet.
el: Τα σχόλια Καταχώρισης Εφαρμογής είχαν μια ενέργεια Επισήμανση ως Χρήσιμο, τόσο στον Περιστροφέα Ενεργειών του VoiceOver όσο και στο μενού παρατεταμένου πατήματος, που απλώς εμφάνιζε ένα μήνυμα «Έρχεται σύντομα» — χωρίς καμία πραγματική λειτουργία ακόμη. Τα Φόρουμ είχαν ήδη αφαιρέσει αυτό για τον ίδιο λόγο, και δεν προστέθηκε ποτέ στους Οδηγούς, τα Ιστολόγια, τα Podcast ή τις Αναφορές Σφαλμάτων. Αφαιρέθηκε και από τις Καταχωρίσεις Εφαρμογών μέχρι να ολοκληρωθεί πραγματικά αυτή η εργασία backend. Αναφέρθηκε απευθείας.
es: Los comentarios de la ficha de la app tenían una acción de Marcar como útil, tanto en el rotor de acciones de VoiceOver como en el menú de pulsación prolongada, que solo mostraba un aviso de "Próximamente" — sin ninguna funcionalidad real todavía. Los foros ya habían eliminado esto por el mismo motivo, y nunca se añadió a guías, blogs, podcasts ni informes de error. También se eliminó de las fichas de apps hasta que ese trabajo del backend esté realmente listo. Reportado directamente.
fa: نظرات صفحهٔ برنامه یک کنش علامت‌گذاری به‌عنوان مفید داشتند، هم در چرخ کنش‌های VoiceOver و هم در منوی فشار طولانی، که فقط پیام «به‌زودی» را نشان می‌داد — بدون هیچ عملکرد واقعی هنوز. انجمن‌ها به همین دلیل قبلاً این را حذف کرده بودند، و اصلاً به راهنماها، وبلاگ‌ها، پادکست‌ها یا گزارش‌های اشکال هم اضافه نشده بود. از صفحات برنامه‌ها هم حذف شد تا آن کار بک‌اند واقعاً آماده شود. مستقیماً گزارش شد.
fr: Les commentaires d'une fiche d'appli avaient une action Marquer comme utile, à la fois dans le rotor d'actions de VoiceOver et dans le menu d'appui long, qui affichait simplement un message « Bientôt disponible » — sans aucune fonctionnalité réelle pour l'instant. Les forums avaient déjà retiré ça pour la même raison, et ce n'était jamais ajouté aux guides, articles de blog, podcasts ou rapports de bug. Retiré aussi des fiches d'appli en attendant que ce travail côté serveur soit vraiment prêt. Signalé directement.
he: לתגובות בדף היישום הייתה פעולת סמן כמועיל, גם ברוטור הפעולות של VoiceOver וגם בתפריט הלחיצה הארוכה, שהציגה רק הודעה "בקרוב" — ללא שום פונקציונליות אמיתית עדיין. בפורומים זה כבר הוסר מאותה סיבה, וזה מעולם לא נוסף למדריכים, בלוגים, פודקאסטים או דוחות באגים. הוסר גם מדפי היישומים עד שעבודת השרת הזו תושלם בפועל. דווח ישירות.
hi: ऐप एंट्री टिप्पणियों में मार्क एज़ हेल्पफुल एक्शन था, VoiceOver के एक्शन रोटर और लॉन्ग-प्रेस मेनू दोनों में, जो केवल "जल्द आ रहा है" संदेश दिखाता था — इसके पीछे अभी तक कोई वास्तविक कार्यक्षमता नहीं थी। फोरम्स में इसी कारण से यह पहले ही हटाया जा चुका था, और यह गाइड, ब्लॉग, पॉडकास्ट या बग रिपोर्ट में कभी जोड़ा ही नहीं गया था। इसे ऐप एंट्री से भी हटा दिया गया है, जब तक कि वह बैकएंड काम वाकई तैयार नहीं हो जाता। सीधे रिपोर्ट किया गया।
id: Komentar Entri Aplikasi memiliki tindakan Tandai sebagai Membantu, baik di rotor Tindakan VoiceOver maupun di menu tekan lama, yang hanya menampilkan pesan "Segera hadir" — belum ada fungsi nyata di baliknya. Forum sudah menghapus ini karena alasan yang sama, dan ini tidak pernah ditambahkan ke Panduan, Blog, Podcast, atau Laporan Bug. Dihapus juga dari Entri Aplikasi sampai pekerjaan backend itu benar-benar siap. Dilaporkan secara langsung.
it: I commenti nella scheda app avevano un'azione Contrassegna come utile, sia nel rotore Azioni di VoiceOver sia nel menu a pressione prolungata, che mostrava solo un messaggio "Prossimamente" — senza alcuna funzionalità reale per ora. I forum avevano già rimosso questa azione per lo stesso motivo, e non era mai stata aggiunta a guide, blog, podcast o segnalazioni di bug. Rimossa anche dalle schede app finché quel lavoro sul backend non sarà davvero pronto. Segnalato direttamente.
ja: アプリエントリのコメントには、VoiceOverのアクションローターとロングプレスメニューの両方に「役に立ったとしてマークする」操作がありましたが、これは「近日公開」というメッセージを表示するだけで、まだ実際の機能はありませんでした。フォーラムでは同じ理由ですでに削除済みで、ガイド、ブログ、ポッドキャスト、バグレポートにはそもそも追加されていませんでした。そのバックエンド作業が本当に完了するまで、アプリエントリからも削除しました。直接報告いただきました。
ko: 앱 항목 댓글에는 VoiceOver 작업 로터와 길게 누르기 메뉴 모두에 유용함으로 표시 작업이 있었지만, 이는 "곧 제공 예정"이라는 메시지만 보여줄 뿐 아직 실제 기능은 없었습니다. 포럼에서는 같은 이유로 이미 제거되었고, 가이드, 블로그, 팟캐스트, 버그 신고에는 애초에 추가된 적이 없습니다. 해당 백엔드 작업이 실제로 준비될 때까지 앱 항목에서도 제거했습니다. 직접 신고되었습니다.
nl: Reacties op een app-vermelding hadden een actie Markeren als nuttig, zowel in de VoiceOver-actierotor als in het menu bij lang indrukken, die alleen het bericht "Binnenkort beschikbaar" liet zien — nog zonder echte functionaliteit. Forums had dit om dezelfde reden al verwijderd, en het was nooit toegevoegd aan gidsen, blogs, podcasts of bugrapporten. Ook verwijderd bij app-vermeldingen totdat dat backend-werk echt klaar is. Rechtstreeks gemeld.
pl: Komentarze wpisu aplikacji miały akcję Oznacz jako pomocne, zarówno w rotorze Akcje VoiceOver, jak i w menu długiego naciśnięcia, która pokazywała jedynie komunikat "Wkrótce" — bez żadnej rzeczywistej funkcjonalności. Na forach usunięto to już wcześniej z tego samego powodu, a do poradników, blogów, podcastów ani zgłoszeń błędów nigdy tego nie dodano. Usunięto to też z wpisów aplikacji, dopóki ta praca po stronie serwera naprawdę nie będzie gotowa. Zgłoszone bezpośrednio.
pt: Os comentários na ficha do app tinham uma ação Marcar como útil, tanto no rotor de Ações do VoiceOver quanto no menu de toque longo, que só mostrava a mensagem "Em breve" — sem nenhuma funcionalidade real ainda. Os fóruns já haviam removido isso pelo mesmo motivo, e nunca foi adicionado a guias, blogs, podcasts ou relatórios de bug. Removido também das fichas de app até que esse trabalho de backend realmente esteja pronto. Reportado diretamente.
ru: Комментарии на странице приложения содержали действие «Отметить как полезное», как в роторе «Действия» VoiceOver, так и в меню долгого нажатия, которое лишь показывало сообщение «Скоро появится» — без какой-либо реальной функциональности пока. На форумах это уже было удалено по той же причине, а в руководства, блоги, подкасты и отчёты об ошибках это никогда и не добавлялось. Удалено и со страниц приложений — пока эта серверная работа не будет действительно готова. Сообщено напрямую.
sv: Kommentarer på en apppost hade en åtgärd Markera som hjälpsam, både i VoiceOvers åtgärdsrotor och i menyn för långt tryck, som bara visade meddelandet "Kommer snart" — utan någon verklig funktion ännu. Forum hade redan tagit bort detta av samma anledning, och det lades aldrig till i guider, blogginlägg, poddar eller buggrapporter. Togs bort från appar också tills det där backend-arbetet verkligen är klart. Rapporterat direkt.
th: ความคิดเห็นในหน้ารายการแอปมีการดำเนินการทำเครื่องหมายว่ามีประโยชน์ ทั้งในโรเตอร์การดำเนินการของ VoiceOver และเมนูกดค้าง ซึ่งแสดงเพียงข้อความ "เร็ว ๆ นี้" — ยังไม่มีฟังก์ชันจริงรองรับ ฟอรัมได้ลบสิ่งนี้ไปแล้วด้วยเหตุผลเดียวกัน และไม่เคยถูกเพิ่มในคู่มือ บล็อก พอดแคสต์ หรือรายงานข้อบกพร่องเลย ลบออกจากหน้ารายการแอปด้วยเช่นกัน จนกว่างานฝั่งเซิร์ฟเวอร์นั้นจะพร้อมจริง ๆ รายงานโดยตรง
tr: Uygulama Girişi yorumlarında, hem VoiceOver'ın Eylemler rotorunda hem de uzun basma menüsünde, yalnızca "Yakında" mesajını gösteren bir Yararlı Olarak İşaretle eylemi vardı — henüz arkasında gerçek bir işlevsellik yoktu. Forumlarda aynı nedenle bu zaten kaldırılmıştı ve rehberlere, bloglara, podcast'lere veya hata raporlarına hiç eklenmemişti. O arka uç çalışması gerçekten hazır olana kadar uygulama girişlerinden de kaldırıldı. Doğrudan bildirildi.
uk: Коментарі на сторінці застосунку мали дію «Позначити як корисне», як у роторі «Дії» VoiceOver, так і в меню довгого натискання, яка лише показувала повідомлення «Незабаром» — поки що без жодної реальної функціональності. На форумах це вже прибрали з тієї самої причини, а до посібників, блогів, подкастів чи звітів про помилки це ніколи й не додавали. Прибрано і зі сторінок застосунків, доки ця серверна робота справді не буде готова. Повідомлено напряму.
vi: Bình luận trên Mục nhập Ứng dụng có thao tác Đánh dấu là hữu ích, cả trong rotor Thao tác của VoiceOver lẫn menu nhấn giữ, chỉ hiển thị thông báo "Sắp ra mắt" — chưa có chức năng thực sự nào phía sau. Diễn đàn đã xóa tính năng này trước đó vì cùng lý do, và nó chưa từng được thêm vào Hướng dẫn, Blog, Podcast hay Báo cáo lỗi. Cũng đã xóa khỏi Mục nhập Ứng dụng cho đến khi công việc phía máy chủ đó thực sự sẵn sàng. Đã được báo cáo trực tiếp.
zh_hans: 应用条目的评论中曾有一个"标记为有帮助"操作，无论是在旁白的操作转子中还是在长按菜单中，都只会弹出一条"即将推出"的提示——背后并没有真正的功能。论坛出于同样的原因早已移除该功能，而指南、博客、播客和错误报告中也从未添加过它。现已从应用条目中一并移除，直到该后端工作真正就绪为止。经直接报告。

source: Editing an App Entry's title or description showed a success message right away, but the About section kept showing the old text until you left the page and came back. The edit itself was always saved; only the screen was stale. Fixed so a confirmed edit shows up immediately. Reported directly.
ar: تعديل عنوان أو وصف صفحة التطبيق كان يُظهر رسالة نجاح فورًا، لكن قسم حول ظل يعرض النص القديم حتى تغادر الصفحة وتعود إليها. التعديل نفسه كان يُحفظ دائمًا؛ فقط الشاشة كانت قديمة. تم الإصلاح بحيث يظهر التعديل المؤكَّد فورًا. أُبلغ عنه مباشرة.
de: Das Bearbeiten des Titels oder der Beschreibung eines App-Eintrags zeigte sofort eine Erfolgsmeldung, aber der Info-Bereich zeigte weiterhin den alten Text, bis man die Seite verließ und zurückkehrte. Die Bearbeitung selbst wurde immer gespeichert; nur der Bildschirm war veraltet. Behoben, sodass eine bestätigte Bearbeitung sofort erscheint. Direkt gemeldet.
el: Η επεξεργασία του τίτλου ή της περιγραφής μιας Καταχώρισης Εφαρμογής εμφάνιζε αμέσως ένα μήνυμα επιτυχίας, όμως η ενότητα Σχετικά συνέχιζε να εμφανίζει το παλιό κείμενο μέχρι να φύγετε από τη σελίδα και να επιστρέψετε. Η ίδια η επεξεργασία αποθηκευόταν πάντα· μόνο η οθόνη ήταν μη ενημερωμένη. Διορθώθηκε ώστε μια επιβεβαιωμένη επεξεργασία να εμφανίζεται αμέσως. Αναφέρθηκε απευθείας.
es: Editar el título o la descripción de una ficha de app mostraba un mensaje de éxito de inmediato, pero la sección Acerca de seguía mostrando el texto antiguo hasta que salías de la página y volvías. La edición en sí siempre se guardaba; solo la pantalla estaba desactualizada. Solucionado para que una edición confirmada aparezca de inmediato. Reportado directamente.
fa: ویرایش عنوان یا توضیحات یک صفحهٔ برنامه بلافاصله پیامی موفقیت‌آمیز نشان می‌داد، اما بخش درباره همچنان متن قدیمی را نشان می‌داد تا زمانی که صفحه را ترک کرده و برمی‌گشتید. خود ویرایش همیشه ذخیره می‌شد؛ فقط صفحه قدیمی بود. برطرف شد تا ویرایش تأییدشده بلافاصله نمایش داده شود. مستقیماً گزارش شد.
fr: Modifier le titre ou la description d'une fiche d'appli affichait aussitôt un message de succès, mais la section À propos continuait d'afficher l'ancien texte jusqu'à ce que vous quittiez la page et y reveniez. La modification elle-même était toujours enregistrée ; seul l'écran était obsolète. Corrigé pour qu'une modification confirmée apparaisse immédiatement. Signalé directement.
he: עריכת הכותרת או התיאור של דף יישום הציגה מיד הודעת הצלחה, אבל מדור מידע המשיך להציג את הטקסט הישן עד שיצאת מהדף וחזרת. העריכה עצמה תמיד נשמרה; רק המסך היה לא מעודכן. תוקן כך שעריכה שאושרה מופיעה מיד. דווח ישירות.
hi: ऐप एंट्री के शीर्षक या विवरण को संपादित करना तुरंत सफलता संदेश दिखाता था, लेकिन बारे में सेक्शन तब तक पुराना टेक्स्ट दिखाता रहता था जब तक आप पेज छोड़कर वापस नहीं आते थे। संपादन खुद हमेशा सेव होता था; बस स्क्रीन पुरानी थी। अब ठीक कर दिया गया है ताकि पुष्टि किया गया संपादन तुरंत दिखे। सीधे रिपोर्ट किया गया।
id: Mengedit judul atau deskripsi Entri Aplikasi langsung menampilkan pesan berhasil, tetapi bagian Tentang tetap menampilkan teks lama sampai Anda meninggalkan halaman dan kembali lagi. Editannya sendiri selalu tersimpan; hanya layarnya yang basi. Diperbaiki agar editan yang dikonfirmasi langsung muncul. Dilaporkan secara langsung.
it: Modificare il titolo o la descrizione di una scheda app mostrava subito un messaggio di successo, ma la sezione Informazioni continuava a mostrare il testo vecchio finché non si lasciava la pagina e si tornava indietro. La modifica stessa veniva sempre salvata; solo la schermata era obsoleta. Risolto in modo che una modifica confermata compaia immediatamente. Segnalato direttamente.
ja: アプリエントリのタイトルや説明を編集すると、すぐに成功メッセージが表示されるものの、概要セクションはページを離れて戻ってくるまで古いテキストを表示したままでした。編集自体は常に保存されており、画面だけが古いままでした。確定した編集がすぐに反映されるように修正しました。直接報告いただきました。
ko: 앱 항목의 제목이나 설명을 편집하면 즉시 성공 메시지가 표시되었지만, 정보 섹션은 페이지를 떠났다가 돌아올 때까지 이전 텍스트를 계속 보여주었습니다. 편집 내용 자체는 항상 저장되었으며, 화면만 오래된 상태였습니다. 이제 확인된 편집 내용이 즉시 반영되도록 수정했습니다. 직접 신고되었습니다.
nl: Het bewerken van de titel of beschrijving van een app-vermelding toonde meteen een succesmelding, maar het gedeelte Over bleef de oude tekst tonen totdat je de pagina verliet en terugkeerde. De bewerking zelf werd altijd opgeslagen; alleen het scherm was verouderd. Opgelost zodat een bevestigde bewerking meteen verschijnt. Rechtstreeks gemeld.
pl: Edycja tytułu lub opisu wpisu aplikacji od razu pokazywała komunikat o powodzeniu, ale sekcja Informacje nadal pokazywała stary tekst, dopóki nie opuściłeś strony i nie wróciłeś. Sama edycja zawsze była zapisywana; tylko ekran był nieaktualny. Naprawione tak, aby potwierdzona edycja pojawiała się od razu. Zgłoszone bezpośrednio.
pt: Editar o título ou a descrição de uma ficha de app mostrava uma mensagem de sucesso imediatamente, mas a seção Sobre continuava mostrando o texto antigo até você sair da página e voltar. A edição em si sempre era salva; só a tela estava desatualizada. Corrigido para que uma edição confirmada apareça imediatamente. Reportado diretamente.
ru: Редактирование заголовка или описания страницы приложения сразу показывало сообщение об успехе, но раздел «О программе» продолжал показывать старый текст, пока вы не покидали страницу и не возвращались обратно. Само редактирование всегда сохранялось; устаревшим был только экран. Исправлено так, чтобы подтверждённое изменение появлялось немедленно. Сообщено напрямую.
sv: Att redigera en apppostens titel eller beskrivning visade genast ett bekräftelsemeddelande, men Om-avsnittet fortsatte visa den gamla texten tills du lämnade sidan och kom tillbaka. Själva redigeringen sparades alltid; det var bara skärmen som var inaktuell. Åtgärdat så att en bekräftad redigering visas omedelbart. Rapporterat direkt.
th: การแก้ไขชื่อหรือคำอธิบายของรายการแอปจะแสดงข้อความสำเร็จทันที แต่ส่วนเกี่ยวกับยังคงแสดงข้อความเดิมจนกว่าคุณจะออกจากหน้านั้นแล้วกลับมาใหม่ การแก้ไขนั้นถูกบันทึกไว้เสมอ มีเพียงหน้าจอเท่านั้นที่ไม่ทันสมัย แก้ไขแล้วให้การแก้ไขที่ยืนยันแล้วปรากฏขึ้นทันที รายงานโดยตรง
tr: Bir Uygulama Girişinin başlığını veya açıklamasını düzenlemek hemen bir başarı mesajı gösteriyordu, ancak Hakkında bölümü siz sayfadan ayrılıp geri dönene kadar eski metni göstermeye devam ediyordu. Düzenlemenin kendisi her zaman kaydediliyordu; sadece ekran güncel değildi. Onaylanan bir düzenlemenin hemen görünmesi için düzeltildi. Doğrudan bildirildi.
uk: Редагування заголовка або опису сторінки застосунку одразу показувало повідомлення про успіх, але розділ «Про застосунок» продовжував показувати старий текст, доки ви не залишали сторінку і не поверталися. Саме редагування завжди зберігалося; застарілим був лише екран. Виправлено так, щоб підтверджена зміна з'являлася негайно. Повідомлено напряму.
vi: Chỉnh sửa tiêu đề hoặc mô tả của Mục nhập Ứng dụng hiển thị thông báo thành công ngay lập tức, nhưng phần Giới thiệu vẫn hiển thị văn bản cũ cho đến khi bạn rời trang và quay lại. Bản chỉnh sửa luôn được lưu; chỉ có màn hình là cũ. Đã khắc phục để bản chỉnh sửa đã xác nhận hiển thị ngay lập tức. Đã được báo cáo trực tiếp.
zh_hans: 编辑应用条目的标题或描述会立即显示成功提示，但"关于"部分会一直显示旧文本，直到你离开该页面再返回。编辑内容本身始终已保存，只是页面显示滞后。现已修复，确认的编辑会立即显示出来。经直接报告。
